fun main() {
    solve()
}

/**
 * На складе товары находятся в 10-ярусном стеллаже, разбитом на 8
 * секций. В каждой секции на каждом ярусе предусмотрено 15 мест для товаров.
 * Склад обслуживается роботом. Определить, в какой секции и на каком ярусе
 * робот должен взять товар, находящийся на месте с заданным номером.
 * |         |       Секция 1        |      Секция 2      | ... | Секция 8 |
 * | Ярус 10 |                       |                    |     |          |
 * |   ...   |                       |                    |     |          |
 * | Ярус 2  | 121 | 122 | ... |     |                    |     |          |
 * | Ярус 1  |  1  |  2  | ... | 1 5 | 16 | 17 | ... | 30 |     |          |
 * Вариант задачи отличается системой нумерации мест: а) по ярусам, б) по секциям.
 * |         |       Секция 1        |      Секция 2      | ... | Секция 8 |
 * | Ярус 10 | 10  | 20  | ... |     |                    |     |          |
 * |   ...   |                       |                    |     |          |
 * | Ярус 2  | 2   | 12  | ... |     |                    |     |          |
 * | Ярус 1  | 1   | 11  | ... | 141 | 151 |   |     |    |     |          |
 */
fun solve() {
    print("Введите номер квартиры: ")
    val k = readLine()?.trim()?.toIntOrNull() ?: 1
    var n = 15 * 8
    var storey = (k - 1) / n
    var section = (k - storey * n - 1) / 15
    println("а) по ярусам. Номер секции: ${section + 1}")
    println("а) по ярусам. Номер яруса: ${storey + 1}")
    n = 15 * 10
    section = (k - 1) / n
    storey = (k - section * n - 1) % 10
    println("б) по секциям. Номер секции: ${section + 1}")
    println("б) по секциям. Номер яруса: ${storey + 1}")
}
